app/controllers/linkages_controller.rb

  def index
    @linkages = Linkage.all
---
SELECT "linkages".* FROM "linkages"

  def show
    @linkage = Linkage.find(params[:id])
---
SELECT "linkages".* FROM "linkages" WHERE "linkages"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @linkage = Linkage.find(params[:id])
---
SELECT "linkages".* FROM "linkages" WHERE "linkages"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @linkage = Linkage.new(params[:linkage])

    respond_to do |format|
      if @linkage.save
---
INSERT INTO "linkages" ("created_at", "description", "link", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 15 Jul 2013 04:05:30 UTC +00:00], ["description", "Is amazing"], ["link", "http://coletteisabella.com"], ["updated_at", Mon, 15 Jul 2013 04:05:30 UTC +00:00]]

  def destroy
    @linkage = Linkage.find(params[:id])
    @linkage.destroy
---
SELECT "linkages".* FROM "linkages" WHERE "linkages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "linkages" WHERE "linkages"."id" = ?  [["id", 1]]